// 1.					4.
// *					     *  
// **					    ***
// ***					   *****
// ****				      *******
// *****				 *********

// 2.					5.
// *****				 *********
// ****				      *******
// ***					   *****
// **						***
// *					     *

// 3.					6. 사용자 입력
    // *				7. 2 ~ 100 사이의 모든 소수 출력하기
   // **
  // ***
 // ****
// *****				/// 콘솔창 폰트 차이 때문에 공백은 두칸으로 설정함

public class Star2 {
	public static void main(String[] args) {
		for (int i = 5; i >= 1; i--) {
			for (int j = 1; j <= i; j++) {
				System.out.print("*");
			} System.out.println();
		}
	}
}
